Tekla Open API Reference for Tekla Structures 2025
InvalidFilterExpressionExceptionReasonsType Enumeration
 The invalid filter expression exception reasons type defines the possible reasons for the InvalidFilterExpressionException.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum InvalidFilterExpressionExceptionReasonsType
Public Enumeration InvalidFilterExpressionExceptionReasonsType
Members
Member name | Value | Description
TOO_MANY_NESTED_COLLECTIONS | 0 |  There are too many nested collections.
See Also
Reference
Tekla.Structures.Filtering Namespace